#+title XPCI Simulations for H-He demixing
#+author: Carsten Fortmann-Grote, Juncheng E
#+date: [2025-03-21 Fri] 
#+property: header-args:python :session remote_py :dir /sshx:deepbio:/home/grotec/Repositories/XPCISims4HHeDemixing :async yes

* Preliminaries
:PROPERTIES:
:ID:       726e4058-e549-49e6-b654-8e9f39d6fed0
:END:
:PROPERTIES:
:ID:       0701dfac-8354-4bc7-ac23-2add285d21c3
#+header-args:python :session remote_py :dir /sshx:deepbio:/home/grotec/Repositories/XPCISims4HHeDemixing :async yes
#+header-args:shell :session remote_bash :dir /sshx:deepbio:/home/grotec/Repositories/XPCISims4HHeDemixing :async yes:END:
#+name: setenv
#+begin_src bash :session remote_bash
  hostname
  pwd
  source ~/miniforge3/bin/activate xpcisim
#+end_src

#+RESULTS: setenv
| micropop133                                    |
| /home/grotec/Repositories/XPCISims4HHeDemixing |

#+begin_src emacs-lisp
(setq org-babel-python-command "/scratch/grotec/mambaforge/envs/xpcisim/bin/python")
#+end_src

#+RESULTS:
: /scratch/grotec/mambaforge/envs/xpcisim/bin/python

** Imports
:PROPERTIES:
:ID:       a55ab8aa-bb3c-4cf4-a9a7-c8e965b0a159
:END:
#+name: imports
#+begin_src python :results output
  from syris.bodies.base import CompositeBody
  from syris.bodies.isosurfaces import MetaBall
  from syris.bodies.mesh import Mesh, make_cube
  from syris.bodies.simple import make_sphere
  from syris.geometry import Trajectory
  from syris.materials import Material
  from syris.materials import make_fromfile
  from syris.materials import make_henke
  from syris.physics import propagate
  import argparse
  import matplotlib.pyplot as plt
  import numpy; np=numpy
  import os
  import quantities as q
  import scipy.misc
  import syris
  import syris.geometry as geom
  import sys
  print("imports done")
#+end_src

#+RESULTS[bfbd2653789ec380db07fbb1091e9d012c76be6f]: imports
: <string>:16: DeprecationWarning: scipy.misc is deprecated and will be removed in 2.0.0
: imports done


